src/cf/InformationRegisters/инт_ОчередьИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_ИсходныеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СформированноеСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ТекущийСтатусИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ТекущийСтатусИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыИсходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/инт_СтатусыИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_СтатусыИсходящихСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКОтправке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаФормирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/инт_ФормированиеИсходящихСообщений/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////

// инт_ФормированиеИсходящихСообщений

//  

////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс
Процедура ЗапускМенеджераПотоков() Экспорт
    РегистрыСведений.инт_МенеджерПотоковФормированияСообщений.СобратьМусор();
    
    КоличествоПотоковКСозданию = РегистрыСведений.инт_МенеджерПотоковФормированияСообщений.КоличествоПотоковКСозданию();
    Для Итератор=1 По КоличествоПотоковКСозданию Цикл
        СоздатьПотокФормированияСообщений();
    КонецЦикла;
КонецПроцедуры

// Процедура - Выполнить обработку сообщений в потоке
//
// Параметры:
//  МассивСообщений     -   Массив   -  Массив уникальных идентификаторов сообщений которые необходимо обработать в потоке.
//
Процедура ВыполнитьОбработкуСообщенийВПотоке(МассивСообщений)
    Поток = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
    Если Поток = Неопределено Тогда
        
    	ВызватьИсключение "Процедура <ВыполнитьОбработкуСообщенийВПотоке> не предназначена для интерактивного выполнения. Она должна работать только в рамках фонового задания.";
    КонецЕсли;
    ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковФормированияСообщений", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Запущена обработка сообщений в потоке с ID <%1>", Поток.УникальныйИдентификатор));

    Для Каждого ИдентификаторСообщения Из МассивСообщений Цикл
        Попытка
            РегистрыСведений.инт_ОчередьИсходящихСообщений.СформироватьСообщениеПоИдентификатору(ИдентификаторСообщения);
        Исключение
            СообщениеОбОшибке = СтрШаблон("В потоке с идентификатором <%1> не удалось сформровать сообщение с идентификтором <%2>.
            |
            |Информация об ошибке: %3",
            Поток.УникальныйИдентификатор,
            ИдентификаторСообщения,
            ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
            ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ПотокФормированияСообщений", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
        КонецПопытки;
        
    КонецЦикла;
    
    РегистрыСведений.инт_МенеджерПотоковФормированияСообщений.ОбработатьЗавершениеРаботыПотока(Поток.УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьПотокФормированияСообщений()
    КоличествоСообщенийВПачке = инт_ФормированиеИсходящихСообщенийПовтИсп.РазмерПачкиФормированияСообщений();
    МассивСообщений = РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.ПолучитьИдентификаторыСообщенийПоСтатусу(Перечисления.инт_СтатусыИсходящихСообщений.Новый,КоличествоСообщенийВПачке);
    
    Если МассивСообщений.Количество = 0 Тогда
        // Нет сообщений для обработки.
    	Возврат;
    КонецЕсли;
    НачатьТранзакцию();
    Попытка
        РегистрыСведений.инт_ТекущийСтатусИсходящихСообщений.ЗаписатьСтатусСообщений(МассивСообщений, Перечисления.инт_СтатусыИсходящихСообщений.ФормированиеСообщения);
        МассивПараметров = Новый Массив;
        МассивПараметров.Добавить(МассивСообщений);
        Поток = ФоновыеЗадания.Выполнить("инт_ФормированиеИсходящихСообщений.ВыполнитьОбработкуСообщенийВПотоке", МассивПараметров, ,"Поток формирования исходящих сообщений.");
        РегистрыСведений.инт_МенеджерПотоковФормированияСообщений.ЗарегистрироватьПоток(Поток.УникальныйИдентификатор, МассивСообщений);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        СообщениеОбОшибке = СтрШаблон("Ошибка при создании потока формирования сообщений.
        |
        |Информация об ошибке: %1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.МенеджерПотоковФормированияСообщений", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
    КонецПопытки;
    
КонецПроцедуры

#КонецОбласти
